[Watchdog X2SoldierClassTemplate]
+DisplayName="看门狗"
+ClassSummary="看门狗通过增强的援助协议、用手枪进行可靠的监视射击，或者用他们的小精灵干扰敌人来保护他们的盟友。"
+LeftAbilityTreeTitle="猎犬"
+RightAbilityTreeTitle="狼"
AbilityTreeTitles[0]="复仇者"
AbilityTreeTitles[1]="保护者"
AbilityTreeTitles[2]="干扰者"
AbilityTreeTitles[3]="XCOM"
AbilityTreeTitles[4]="手枪"

+RandomNickNames[0]="Hound"
+RandomNickNames[1]="Dog"
+RandomNickNames[2]="Sentry"
+RandomNickNames[3]="Poodle"
+RandomNickNames[4]="Guardian"
+RandomNickNames[5]="Sentinel"
+RandomNickNames[6]="Protector"


